// Напишите программу вычисления функции куба числа

Console.Clear();
Console.WriteLine("Введите число: ");
string num = Console.ReadLine();
int numInt = Convert.ToInt32(num);
Console.WriteLine(numInt * numInt * numInt);

